spec/cassettes/StripeWrapper/StripeWrapper_Charge/_create/with_invalid_input/charges_card_successfully.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: US-ASCII
      string: card[number]=4000000000000069&card[exp_month]=12&card[exp_year]=2018&card[cvc]=314
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/3.8.0
      Authorization:
      - Bearer sk_test_R7CsF65YXLyWRgQfDF7X0QBq
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"3.8.0","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"x86_64-darwin13.0","engine":"ruby","publisher":"stripe","uname":"Darwin
        Awlter 17.2.0 Darwin Kernel Version 17.2.0: Fri Sep 29 18:27:05 PDT 2017;
        root:xnu-4570.20.62~3/RELEASE_X86_64 x86_64","hostname":"Awlter"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 16 Dec 2017 03:07:04 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '781'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - X-Stripe-Privileged-Session-Required,stripe-manage-version,X-Stripe-External-Auth-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_mdJEy2prnK5Na5
      Stripe-Version:
      - '2017-08-15'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tok_1BZW0yFbDoFsZOtGgqUb3oJM",
          "object": "token",
          "card": {
            "id": "card_1BZW0yFbDoFsZOtGNO1OeY4b",
            "object": "card",
            "address_city": null,
            "address_country": null,
            "address_line1": null,
            "address_line1_check": null,
            "address_line2": null,
            "address_state": null,
            "address_zip": null,
            "address_zip_check": null,
            "brand": "Visa",
            "country": "US",
            "cvc_check": "unchecked",
            "dynamic_last4": null,
            "exp_month": 12,
            "exp_year": 2018,
            "fingerprint": "GwrG2lyYEWT6CPgI",
            "funding": "credit",
            "last4": "0069",
            "metadata": {},
            "name": null,
            "tokenization_method": null
          },
          "client_ip": "121.58.37.135",
          "created": 1513393624,
          "livemode": false,
          "type": "card",
          "used": false
        }
    http_version: 
  recorded_at: Sat, 16 Dec 2017 03:07:04 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: US-ASCII
      string: amount=999&currency=usd&card=tok_1BZW0yFbDoFsZOtGgqUb3oJM
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/3.8.0
      Authorization:
      - Bearer sk_test_R7CsF65YXLyWRgQfDF7X0QBq
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"3.8.0","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"x86_64-darwin13.0","engine":"ruby","publisher":"stripe","uname":"Darwin
        Awlter 17.2.0 Darwin Kernel Version 17.2.0: Fri Sep 29 18:27:05 PDT 2017;
        root:xnu-4570.20.62~3/RELEASE_X86_64 x86_64","hostname":"Awlter"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 402
      message: Payment Required
    headers:
      Server:
      - nginx
      Date:
      - Sat, 16 Dec 2017 03:07:06 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '186'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - X-Stripe-Privileged-Session-Required,stripe-manage-version,X-Stripe-External-Auth-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_x8DOS43ixS4mYS
      Stripe-Version:
      - '2017-08-15'
    body:
      encoding: UTF-8
      string: |
        {
          "error": {
            "message": "Your card has expired.",
            "type": "card_error",
            "param": "exp_month",
            "code": "expired_card",
            "charge": "ch_1BZW10FbDoFsZOtG6phCRPeB"
          }
        }
    http_version: 
  recorded_at: Sat, 16 Dec 2017 03:07:07 GMT
recorded_with: VCR 3.0.3
